{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_8",
      "layers": [
        {
          "class_name": "Sequential",
          "config": {
            "name": "sequential_5",
            "layers": [
              {
                "class_name": "Model",
                "config": {
                  "name": "model2",
                  "layers": [
                    {
                      "name": "input_1",
                      "class_name": "InputLayer",
                      "config": {
                        "batch_input_shape": [null, 224, 224, 3],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input_1"
                      },
                      "inbound_nodes": []
                    },
                    {
                      "name": "Conv1_pad",
                      "class_name": "ZeroPadding2D",
                      "config": {
                        "padding": [[0, 1], [0, 1]],
                        "data_format": "channels_last",
                        "name": "Conv1_pad",
                        "trainable": true
                      },
                      "inbound_nodes": [[["input_1", 0, 0, {}]]]
                    },
                    {
                      "name": "Conv1",
                      "class_name": "Conv2D",
                      "config": {
                        "filters": 16,
                        "kernel_initializer": {
                          "class_name": "VarianceScaling",
                          "config": { "scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [3, 3],
                        "strides": [2, 2],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [1, 1],
                        "activation": "linear",
                        "use_bias": false,
                        "bias_initializer": { "class_name": "Zeros", "config": {} },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "Conv1",
                        "trainable": true
                      },
                      "inbound_nodes": [[["Conv1_pad", 0, 0, {}]]]
                    },
                    {
                      "name": "bn_Conv1",
                      "class_name": "BatchNormalization",
                      "config": {
                        "axis": -1,
                        "momentum": 0.999,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": { "class_name": "Zeros", "config": {} },
                        "gamma_initializer": { "class_name": "Ones", "config": {} },
                        "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
                        "moving_variance_initializer": { "class_name": "Ones", "config": {} },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null,
                        "name": "bn_Conv1",
                        "trainable": true
                      },
                      "inbound_nodes": [[["Conv1", 0, 0, {}]]]
                    },
                    {
                      "name": "Conv1_relu",
                      "class_name": "ReLU",
                      "config": { "max_value": 6, "name": "Conv1_relu", "trainable": true },
                      "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]]
                    }
                  ],
                  "input_layers": [["input_1", 0, 0]],
                  "output_layers": [["out_relu", 0, 0]]
                }
              },
              {
                "class_name": "GlobalAveragePooling2D",
                "config": {
                  "data_format": "channels_last",
                  "name": "global_average_pooling2d_GlobalAveragePooling2D2",
                  "trainable": true
                }
              }
            ]
          }
        },
        {
          "class_name": "Sequential",
          "config": {
            "name": "sequential_7",
            "layers": [
              {
                "class_name": "Dense",
                "config": {
                  "units": 100,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": { "scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null }
                  },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null,
                  "name": "dense_Dense3",
                  "trainable": true,
                  "batch_input_shape": [null, 1280],
                  "dtype": "float32"
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "units": 18,
                  "activation": "softmax",
                  "use_bias": false,
                  "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": { "scale": 1, "mode": "fan_in", "distribution": "normal", "seed": null }
                  },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null,
                  "name": "dense_Dense4",
                  "trainable": true
                }
              }
            ]
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 1.7.4",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [{ "paths": ["weights.bin"], "weights": [] }]
}
